Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Inability to provide certificates at run time instead of build time (GraalVM limitation) https://github.com/oracle/graal/pull/3091[#3091]
ja_jp: 証明書をビルド時ではなく実行時に提供できない（GraalVMの制限) link:https://github.com/oracle/graal/pull/3091[#3091]

source: Inactive Synthetic Bean - Build Step Example
ja_jp: 非アクティブな合成 Bean - ビルドステップの例

source: Inactive Synthetic Bean - Recorder Example
ja_jp: 非アクティブな合成 Bean - レコーダーの例

source: Inactive Synthetic Beans
ja_jp: 非アクティブな合成 Bean

source: Inbound Metadata
ja_jp: インバウンドメタデータ

source: Inbound processing mode
ja_jp: 受信処理モード

source: Include JCMD support
ja_jp: JCMD サポートを含める

source: Include JDK Flight Recorder support
ja_jp: JDK Flight Recorder のサポートを含む

source: Include Section
ja_jp: セクションを含む

source: Include `quarkus-opentelemetry-exporter-otlp` into `quarkus-opentelemetry`
ja_jp: `quarkus-opentelemetry` に `quarkus-opentelemetry-exporter-otlp` を追加

source: Include a template with id `foo`. The included template can reference data from the current context.
ja_jp: id `foo` でテンプレートをインクルードします。インクルードされたテンプレートは、現在のコンテキストからデータを参照することができます。

source: Include additional attributes that help define consistent formatting and provide source portability.
ja_jp: 一貫したフォーマットを定義し、ソースの移植性を提供する際に役立つ追加の属性を含めます。

source: Include both `runtime` and `deployment` modules
ja_jp: `runtime` と `deployment` の両方のモジュールをインクルード

source: Include client id
ja_jp: クライアント ID を含める

source: Include common document attributes.
ja_jp: 共通のドキュメント属性をインクルードする。

source: Include extension status descriptive text
ja_jp: エクステンションステータスの説明テキストを含める

source: Include the common file that provides text describing prerequisites.
ja_jp: 前提条件を説明するテキストを提供する共通ファイルを含めます。

source: Include the diataxis type (concept, howto, reference, tutorial) in the file name if it makes sense to do so. For example, `telemetry-micrometer.adoc` is a reference, and `telemetry-micrometer-tutorial.adoc` is a tutorial.
ja_jp: 必要に応じて、ダイアタキシスの種類 (概念、ハウツー、リファレンス、チュートリアル) をファイル名に含めます。 たとえば、 `telemetry-micrometer.adoc` はリファレンスであり、 `telemetry-micrometer-tutorial.adoc` はチュートリアルです。

source: Include the fragment `strong` and pass the value.
ja_jp: フラグメント `strong` をインクルードし、値を渡す。

source: Include the fragment `strong` and pass the value. Note the syntax `$strong` which is translated to include the fragment `strong` from the current template.
ja_jp: フラグメント `strong` をインクルードし、値を渡します。 構文 `$strong` に注意してください。これは、現在のテンプレートからフラグメント `strong` をインクルードするように処理されます。

source: Include/Exclude JAX-RS classes
ja_jp: JAX-RSクラスを含める/除外する

source: Include/Exclude JAX-RS classes with build time conditions
ja_jp: ビルド時条件による JAX-RS クラスの包含および除外

source: Include/Exclude Jakarta REST classes
ja_jp: Jakarta RESTクラスのインクルード／エクスクルード

source: Include/Exclude Jakarta REST classes with build time conditions
ja_jp: ビルド時条件でのJakarta RESTのクラスのインクルード/エクスクルード

source: Included: MicroProfile Configuration via SmallRye
ja_jp: SmallRye 経由の MicroProfile Configuration

source: Included: centralized log management for Quarkus
ja_jp: Quarkus 向けの一元化されたログ管理

source: Includes a resource bundle in the native executable.
ja_jp: ネイティブ実行可能ファイルにリソースバンドルを含めます。

source: Includes directory's static resources into the native executable.
ja_jp: ディレクトリの静的リソースをネイティブ実行可能ファイルにインクルードします。

source: Includes static resources into the native executable.
ja_jp: ネイティブ実行可能ファイルに静的なリソースをインクルードします。

source: Includes the `Greeting` pojo with the `@AutoProtoSchemaBuilder` annotation
ja_jp: `@AutoProtoSchemaBuilder` のアノテーションに `Greeting` POJOを含めます。

source: Includes the `Greeting` pojo with the `@ProtoSchema` annotation
ja_jp: `@ProtoSchema` アノテーションで `Greeting` pojo をインクルードします。

source: Including a Fragment in `user.html`
ja_jp: `user.html`にフラグメントをインクルード

source: Including any one of those extensions in an application will enable the RESTEasy JSON serializer. In case a build step needs to check whether the RESTEasy JSON serializer is already enabled in an application, instead of checking whether any of those capabilities is present, it could simply check whether an extension with prefix `io.quarkus.resteasy.json` is present.
ja_jp: これらのエクステンションのいずれかをアプリケーションに含めると、RESTEasy JSONシリアライザが有効になります。ビルド・ステップで、RESTEasy JSONシリアライザがアプリケーションですでに有効になっているかどうかをチェックする必要がある場合、これらのケイパビリティのいずれかが存在するかどうかをチェックする代わりに、プレフィックス `io.quarkus.resteasy.json` を持つエクステンションが存在するかどうかを単純にチェックすることができます。

source: Including any one of those extensions in an application will enable the RESTEasy JSON serializer. In case a build step needs to check whether the RESTEasy JSON serializer is already enabled in an application, instead of checking whether any of those capabilities is present, it could simply check whether an extension with the prefix `io.quarkus.resteasy.json` is present.
ja_jp: これらのエクステンションのいずれかをアプリケーションに含めると、RESTEasy JSON シリアライザーが有効になります。ビルドステップで、RESTEasy JSON シリアライザーがアプリケーションで既に有効になっているかを確認する必要がある場合、それらの機能のいずれかが存在するかどうかを確認する代わりに、`io.quarkus.resteasy.json` というプレフィックスを持つエクステンションが存在するかどうかを単に確認することができます。

source: Including extra files
ja_jp: 追加ファイルの追加

source: Including resources
ja_jp: リソースのインクルード

source: Including the documentation in the extension guide
ja_jp: エクステンションガイドにドキュメントを含める

source: Including the method name into the cache key is not expensive, unlike other methods from `Method`.
ja_jp: メソッド名をキャッシュキーに含めることは、 `Method` の他のメソッドとは異なり、高価なものではありません。

source: Inclusion in registry used by Quarkus tooling to browse extensions (i.e. code.quarkus.io, command line and IDE tools).
ja_jp: エクステンション (code.quarkus.io、コマンドライン、IDEツールなど) を参照するための Quarkus ツールで使用されるレジストリーへの収録

source: Inclusive Authentication
ja_jp: 統合認証

source: Incoming Attributes of the 'smallrye-kafka' connector
ja_jp: 'smallrye-kafka' connector の Incoming 属性

source: Incoming Attributes of the 'smallrye-pulsar' connector
ja_jp: 'smallrye-pulsar' コネクターの受信属性

source: Incoming Channel Concurrency
ja_jp: 着信チャネルの同時実行

source: Incoming channel configuration
ja_jp: 受信チャネルの設定

source: Incoming channel configuration (polling from Kafka)
ja_jp: 着信チャネル設定 (Kafka からのポーリング)

source: Incoming channel configuration (receiving from Pulsar)
ja_jp: 着信チャネル設定 (Pulsar からの受信)

source: Incoming channels (PublisherDecorator) in the order of priority:
ja_jp: 着信チャネル (PublisherDecorator) の優先順位:

source: Incorporate AI directly into development workflow with instant feedback, code explanations, and documentation, speeding up iterations.
ja_jp: 即座のフィードバック、コードの説明、ドキュメントを活用してAIを開発ワークフローに直接組み込み、反復作業を迅速化します。

source: Incorrect
ja_jp: 間違い

source: Incorrectly escaped patterns can lead to unintended behavior or security vulnerabilities. Always verify regular expression syntax before deployment.
ja_jp: 誤ってエスケープされたパターンは、意図しない動作やセキュリティーの脆弱性につながる可能性があります。 デプロイメントする前に必ず正規表現の構文を確認してください。

source: Increased debug output compared to `TRACE`, which might have a higher frequency.
ja_jp: `TRACE` と比較して、更に度合いの強いデバッグ出力。高頻度の場合があります。

source: Increased productivity and quality
ja_jp: 生産性と品質の向上

source: Increased stability and performance
ja_jp: 安定性とパフォーマンスの向上

source: Increment a value given its key
ja_jp: キーが与えられた値をインクリメントします

source: Increment that counter.
ja_jp: そのカウンターをインクリメントします。

source: Increment the `first` value by 27.
ja_jp: `first` の値を 27 増やします。

source: Increment the counter by one for each invocation of the `hello()` method.
ja_jp: `hello()` メソッドが呼び出されるたびに、カウンターを 1 ずつ増やします。

source: Increment the counter by one.
ja_jp: カウンターを 1 増やします。

source: Increment the value associated with the given key
ja_jp: キーが与えられた値をインクリメントします

source: Increment the value. If there are no counter stored for the key, the `incr` command considers 0 as value (so `incr` sets the value to 1).
ja_jp: 値を増やします。キーのカウンターが格納されていない場合は、 `incr` コマンドは 0 を値とみなします (したがって `incr` は値を 1 に設定します)。

source: Incremental migrations from entity changes
ja_jp: エンティティーの変更による増分マイグレーション

source: Indeed, for 2.2, we decided to slow down on adding new features and focus this release cycle on hardening Quarkus with 3 main focuses:
ja_jp: 実際、2.2では新機能の追加を控え、今回のリリースサイクルではQuarkusの強化に次の3つの重点を置くことにしました:

source: Indeed, the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#client_proxies[client proxies, window="_blank"] could be hard to grasp but they provide some useful functionality. A client proxy is basically an object that delegates all method invocations to a target bean instance. It's a container construct that implements `io.quarkus.arc.ClientProxy` and extends the bean class.
ja_jp: 確かに、 link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#client_proxies[クライアントプロキシ] は把握しにくいかもしれませんが、便利な機能を提供します。クライアントプロキシは基本的に、すべてのメソッド呼び出しをターゲットBeanインスタンスに委譲するオブジェクトです。これは、 `io.quarkus.arc.ClientProxy` を実装し、Bean クラスを拡張したコンテナ構造体です。

source: Indeed, the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#client_proxies[client proxies, window="_blank"] could be hard to grasp, but they provide some useful functionality. A client proxy is basically an object that delegates all method invocations to a target bean instance. It's a container construct that implements `io.quarkus.arc.ClientProxy` and extends the bean class.
ja_jp: 確かに、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#client_proxies[クライアントプロキシ, window=_blank]はわかりにくいかもしれませんが、便利な機能を提供しています。クライアントプロキシとは、基本的に、すべてのメソッドの呼び出しを対象となるBeanインスタンスに委譲するオブジェクトです。クライアントプロキシは、 `io.quarkus.arc.ClientProxy` を実装し、Beanクラスを拡張したコンテナ構造です。

source: Indeed, the https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#client_proxies[client proxies, window="_blank"] could be hard to grasp, but they provide some useful functionality. A client proxy is basically an object that delegates all method invocations to a target bean instance. It's a container construct that implements `io.quarkus.arc.ClientProxy` and extends the bean class.
ja_jp: 実際、 https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#client_proxies[クライアントプロキシ, window="_blank"] は把握しにくいかもしれませんが、いくつかの便利な機能を提供します。 クライアントプロキシは，基本的に，すべてのメソッド呼び出しをターゲットBeanインスタンスに委譲するオブジェクトです。 これは， `io.quarkus.arc.ClientProxy` を実装し，Beanクラスを拡張するコンテナ構成体です。

source: Indeed, the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#client_proxies[client proxies, window="_blank"] could be hard to grasp, but they provide some useful functionality. A client proxy is basically an object that delegates all method invocations to a target bean instance. It's a container construct that implements `io.quarkus.arc.ClientProxy` and extends the bean class.
ja_jp: 確かに、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#client_proxies[クライアントプロキシー, window="_blank"] は理解しにくいかもしれませんが、いくつかの便利な機能を提供します。 クライアントプロキシーは基本的に、ターゲット Bean インスタンスへのすべてのメソッド呼び出しを委譲するオブジェクトです。 これは、 `io.quarkus.arc.ClientProxy` を実装し、Bean クラスを拡張するコンテナー構造です。

source: Indexed Properties
ja_jp: インデックスされたプロパティ

source: Indexed Properties are not supported in Environment Variables.
ja_jp: インデックス付きプロパティーは、環境変数ではサポートされていません。

source: Indexed Properties provide a way to use indexes in config property names to map specific elements in a `Collection` type. Since the indexed element is part of the property name and not contained in the value, this can also be used to map complex object types as `Collection` elements. Consider:
ja_jp: インデックス付きプロパティーは、設定プロパティー名のインデックスを使用して、 `Collection` タイプの特定の要素をマップする方法を提供します。インデックス付き要素はプロパティー名の一部であり、値に含まれていないため、これを使用して、複雑なオブジェクトタイプを `Collection` 要素としてマップすることもできます。以下の例の場合、

source: Indexed Properties provide a way to use indexes in config property names to map specific elements in a `Collection` type. Since the indexed element is part of the property name and not contained in the value, this can also be used to map complex object types as `Collectionª elements. Consider:
ja_jp: インデックス付きプロパティーは、設定プロパティー名のインデックスを使用して、 `Collection` タイプの特定の要素をマップする方法を提供します。インデックス付き要素はプロパティー名の一部であり、値に含まれていないため、これを使用して、複雑なオブジェクトタイプを `Collectionª 要素としてマップすることもできます。以下の例を考えてみます。

source: Indexed properties
ja_jp: インデックスされたプロパティ

source: Indexer does not include your external dependency
ja_jp: インデクサーには外部依存関係は含まれていません

source: Indicate 2 sub-protocols supported by the client, the sub-protocol of your choice and the Quarkus HTTP upgrade sub-protocol.
ja_jp: クライアントでサポートされている 2 つのサブプロトコル (選択したサブプロトコルと Quarkus HTTP アップグレードサブプロトコル) を指定します。

source: Indicate that the "jakarta.xml.bind.Messages" resource bundle should be copied into native image.
ja_jp: "jakarta.xml.bind.Messages"リソースバンドルがネイティブイメージにコピーされることを示します。

source: Indicate that the "javax.xml.bind.Messages" resource bundle should be copied into native image.
ja_jp: javax.xml.bind.Messages リソースバンドルをネイティブイメージにコピーする必要があることを示します。

source: Indicate that the /security/runtime.keys classpath resource should be copied into native image.
ja_jp: /security/runtime.keys クラスパスリソースをネイティブイメージにコピーする必要があることを示します。

source: Indicate that the `META-INF/my-descriptor.xml` resource should be copied into native image
ja_jp: `META-INF/my-descriptor.xml` リソースをネイティブイメージにコピーする必要があることを示します。

source: Indicate that the `topic` property is a regular expression. Must be used with the `topic` property. Cannot be used with the `topics` property Type: _boolean_
ja_jp: `topic` プロパティが正規表現であることを示す。 `topic` プロパティと併用する必要があります。 `topics` プロパティとは併用できません。 Type: _boolean_

source: Indicate that the scheduler will be run in clustered mode
ja_jp: スケジューラーがクラスターモードで実行されることを示します

source: Indicate that this injection point is meant to use an instance of `RestClient`.
ja_jp: この注入ポイントが `RestClient` のインスタンスを使用することを意味していることを示します。

source: Indicate that we don't want to generate any test
ja_jp: テスト不要を示す

source: Indicates that all charsets should be enabled in native image.
ja_jp: ネイティブイメージですべての文字セットを有効にすることを示します。

source: Indicates that the content is sent using `Server Sent Events`
ja_jp: `Server Sent Events` を使用してコンテンツが送信されたことを示します。

source: Indicates that the entity will be indexed. Necessary to perform distributed full-text query operations.
ja_jp: エンティティがインデックス化されることを示します。分散全文クエリ操作を実行するために必要です。

source: Indicates that the method consumes the items from the `requests` channel
ja_jp: メソッドが `requests` チャネルからのアイテムを消費することを示します。

source: Indicates that the method consumes the items from the `requests` channel.
ja_jp: メソッドが `requests` チャネルからのアイテムを消費することを示します。

source: Indicates that the objects returned by the method are sent to the `quotes` channel
ja_jp: メソッドによって返されるオブジェクトが `quotes` チャネルに送信されることを示します。

source: Indicates that the objects returned by the method are sent to the `quotes` channel.
ja_jp: メソッドによって返されるオブジェクトが `quotes` チャネルに送信されることを示します。

source: Indicates that the processing is _blocking_ and cannot be run on the caller thread.
ja_jp: 処理が _blocking_ であり、呼び出し元のスレッドでは実行できないことを示します。

source: Indicates the `description` field field should be indexed as a Keyword.
ja_jp: `description` フィールドが Keyword としてインデックスされることを示します。

source: Indicates the `title` should be indexed as text
ja_jp: `title` がテキストとしてインデックスされることを示します。

source: Indicates the comma-separated list of roles added to the target principal representation attributes.
ja_jp: ターゲットプリンシパル表現属性に追加されたロールのコンマ区切りリストを示します。

source: Indicates the field used for the password, which defaults to using bcrypt hashed passwords but you can also configure it for plain text or custom passwords.
ja_jp: パスワードに使用するフィールドを示します。デフォルトではbcryptハッシュ化されたパスワードを使用しますが、プレーンテキストまたはカスタムパスワード用に設定することも可能です。

source: Indicates the field used for the password. By default, `quarkus-security-jpa` uses bcrypt-hashed passwords, or you can configure plain text or custom passwords instead.
ja_jp: パスワードに使用するフィールドを示します。 デフォルトでは、 `quarkus-security-jpa` は bcrypt-hashed パスワードを使用しますが、代わりにプレーンテキストまたはカスタムパスワードを設定することもできます。

source: Indicates the field used for the password. By default, `security-jpa` uses bcrypt-hashed passwords, or you can configure plain text or custom passwords instead.
ja_jp: パスワードに使用するフィールドを示します。デフォルトでは、 `security-jpa` は bcryptでハッシュ化されたパスワードを使用します。代わりにプレーンテキストまたはカスタムパスワードを設定することもできます。

source: Indicates the field used for the password. By default, it uses bcrypt-hashed passwords. You can configure it to use plain text or custom passwords.
ja_jp: パスワードに使用するフィールドを示します。 デフォルトでは、bcrypt でハッシュされたパスワードを使用します。 プレーンテキストまたはカスタムパスワードを使用するように設定できます。

source: Indicates the field used for the user name.
ja_jp: ユーザー名に使用されるフィールドを示します。

source: Indicates the field used for the username.
ja_jp: ユーザー名に使用するフィールドを示します。

source: Indicates the percent of traffic that is be routed to this revision
ja_jp: このリビジョンにルーティングされる Traffic の割合を示します。

source: Indicates whether a component is a runtime or a build/development time dependency of an application.
ja_jp: コンポーネントがアプリケーション実行時の依存関係であるか、ビルド/開発時の依存関係であるかを示します。

source: Individual OIDC endpoint URLs such as `quarkus.oidc.authorization-path` can also be set when you need to override one of the discovered OIDC endpoint URLs or when the discovered OIDC metadata does not include a required endpoint URL.
ja_jp: 検出された OIDC エンドポイント URL のいずれかをオーバーライドする必要がある場合や、検出された OIDC メタデータに必要なエンドポイント URL が含まれていない場合には、 `quarkus.oidc.authorization-path` などの個別の OIDC エンドポイント URL を設定することもできます。

source: Individual OIDC tenant statuses are `OK`, `Not Ready`, `Disabled`, `Unknown` and `Error`.
ja_jp: 個々の OIDC テナントのステータスは、 `OK` 、 `Not Ready` 、 `Disabled` 、 `Unknown` 、および `Error` です。

source: Infinispan Cache
ja_jp: Infinispan キャッシュ

source: Infinispan Caching annotations are deprecated *in this extension* and will be removed. Use or replace your annotations by using the xref:cache-infinispan-reference.adoc[Infinispan Cache extension]. Update your import statements to use the annotations from `io.quarkus.cache` package instead of `io.quarkus.infinispan.client`.
ja_jp: Infinispan Caching アノテーションは *このエクステンションでは* 非推奨であり、削除される予定です。 xref:cache-infinispan-reference.adoc[Infinispan Cache 拡張] 機能を使用するか、アノテーションを置き換えてください。 `io.quarkus.infinispan.client` の代わりに `io.quarkus.cache` パッケージのアノテーションを使用するように import 文を更新してください。

source: Infinispan Client
ja_jp: Infinispanクライアント

source: Infinispan Client Extension Reference Guide
ja_jp: Infinispanクライアントエクステンションリファレンスガイド

source: Infinispan Client extension is not able yet to cache `null` values unlike the Quarkus-Cache extension.
ja_jp: Infinispan Client エクステンションは、Quarkus-Cache エクステンションとは異なり、まだ `null` 値をキャッシュすることができません。

source: Infinispan Health Check
ja_jp: Infinispan ヘルス・チェック

source: Infinispan Server *enables authentication and security authorization by default*, so you need to create a user with permissions.
ja_jp: Infinispan サーバーは *デフォルトで認証とセキュリティ 認可を有効にしている* ので、権限を持つユーザーを作成する必要があります。

source: Infinispan Server also enables authentication and security authorization by default so you need to create a user with permissions.
ja_jp: Infinispan Serverはデフォルトで認証とセキュリティ認可も有効にしているので、権限を持つユーザーを作成する必要があります。

source: Infinispan Server also enables authentication and security authorization by default, so you need to create a user with permissions.
ja_jp: また、Infinispan Serverはデフォルトで認証とセキュリティの認可を有効にしているので、権限のあるユーザーを作成する必要があります。

source: Infinispan Server provides a web console that can be accessed with a browser:
ja_jp: Infinispan Serverには、ブラウザでアクセスできるWebコンソールが用意されています:

source: Infinispan also has a notion of counters and the Quarkus Infinispan client supports them out of the box.
ja_jp: Infinispanにはカウンターという概念もあり、Quarkus Infinispanのクライアントはそれらもサポートしています。

source: Infinispan as cache backend
ja_jp: キャッシュバックエンドとしての Infinispan

source: Infinispan caches can store keys and values in different encodings, but recommend using https://developers.google.com/protocol-buffers[Protocol Buffers (Protobuf)].
ja_jp: Infinispanのキャッシュは、さまざまなエンコーディングでキーと値を保存できますが、 link:https://developers.google.com/protocol-buffers[プロトコル・バッファ（Protobuf）] の使用を推奨します。

source: Infinispan caches provide several features that need to connect to a persistence layer using a particular SQL database driver such as persisting caches in a SQL database or off-loading database tables or queries with SQL cache stores.
ja_jp: Infinispanのキャッシュは、SQLデータベースにキャッシュを永続化したり、SQLキャッシュストアでデータベースのテーブルやクエリをオフロードするなど、特定のSQLデータベースドライバを使用して永続化レイヤーに接続する必要がある機能をいくつか提供しています。

source: Infinispan client uses intelligence mechanisms to efficiently send requests to Infinispan Server clusters. By default, the *HASH_DISTRIBUTION_AWARE* intelligence mechanism is enabled. However, locally with Docker for Mac, you might experience connectivity issues. In this case, configure the client intelligence to *BASIC*.
ja_jp: Infinispanクライアントは、Infinispan サーバークラスタに効率的にリクエストを送信するためにインテリジェンスメカニズムを使用します。デフォルトでは、 *HASH_DISTRIBUTION_AWARE* インテリジェンスメカニズムが有効になっています。しかし、ローカルでDocker for Macを使用すると、接続性の問題が発生する場合があります。この場合、クライアントのインテリジェンスを *BASICに* 設定します。

source: Infinispan is a distributed, in-memory key/value store that provides Quarkus applications with a highly configurable and independently scalable data layer. This extension gives you client functionality that connects applications running on Quarkus with remote Infinispan clusters.
ja_jp: Infinispanは分散型のインメモリキー/バリューストアで、Quarkusアプリケーションに、高度に設定可能で独立して拡張可能なデータレイヤーを提供します。 このエクステンションにより、Quarkus上で動作するアプリケーションをリモートのInfinispanクラスタと接続するクライアント機能が提供されます。

source: Infinispan is a distributed, in-memory key/value store that provides Quarkus applications with a highly configurable and independently scalable data layer. This extension gives you client functionality that connects applications running on Quarkus with remote Infinispan clusters. To get started with Infinispan, we recommend:
ja_jp: Infinispanは、分散型のインメモリキー/バリューストアで、Quarkusアプリケーションに高度に設定可能で独立して拡張可能なデータレイヤーを提供します。このエクステンションでは、Quarkus上で動作するアプリケーションとリモートのInfinispanクラスターを接続するクライアント機能が提供されます。Infinispanを使い始めるには、以下をお勧めします:

source: Infinispan is an in memory data grid that allows running in a server outside of application processes.
ja_jp: Infinispanはインメモリデータグリッドで、アプリケーションプロセスの外側でサーバーを実行することが出来ます。

source: Infinispan is an in memory data grid that allows running in a server outside of application processes. This extension provides functionality to allow the client that can connect to said server when running in Quarkus.
ja_jp: Infinispanは、アプリケーションプロセス以外のサーバーでの実行を可能にするメモリー内データグリッドです。このエクステンションは、Quarkusで実行しているときに、クライアントがサーバーに接続できるようにする機能を提供します。

source: Infinispan is an in memory distributed data store and cache server that offers flexible deployment options and robust capabilities for storing, managing, and processing data.
ja_jp: Infinispanは、インメモリ分散型データストアおよびキャッシュサーバーで、柔軟な導入オプションと、データの保存、管理、処理のための堅牢な機能を提供します。

source: Infinispan needs the SQL Java Driver depending on the database kind the application is using. To spin up a container with a particular SQL driver, configure `quarkus.infinispan-client.devservices.artifacts`.
ja_jp: Infinispan は、アプリケーションが使用するデータベースの種類に応じて、SQL Java Driver を必要とします。特定の SQL ドライバでコンテナをスピンアップするには、 `quarkus.infinispan-client.devservices.artifacts` を設定します。

source: Infinispan supports instrumentation of the server via OpenTelemetry. Enable tracing setting `quarkus.infinispan-client.devservices.tracing.enabled` to true. The default otlp exporter endpoint is `http://localhost:4317`. If you are running Jaeger in a container as explained in the xref:opentelemetry.adoc[OpenTelemetry guide], since the containers are running in the default network, Infinispan container won't have access to localhost. You need to get the IP running the following command and configure the `quarkus.infinispan-client.devservices.tracing.exporter.otlp.endpoint` property.
ja_jp: Infinispanは、OpenTelemetryによるサーバーのインスツルメンテーションをサポートしています。トレースを有効にするには、 `quarkus.infinispan-client.devservices.tracing.enabled` を true に設定します。デフォルトの otlpエクスポーターエンドポイントは `http://localhost:4317` です。 xref:opentelemetry.adoc[OpenTelemetryのガイド] で説明されているように、コンテナでJaegerを実行している場合、コンテナはデフォルトのネットワークで実行されているため、Infinispanコンテナはlocalhostにアクセスすることができません。以下のコマンドでIPを取得し、 `quarkus.infinispan-client.devservices.tracing.exporter.otlp.endpoint` プロパティを設定する必要があります。
